/*
Дана строка s, найдите длину самой длинной из них. подстрокабез повторяющихся символов.



Пример 1:

Ввод: s = "abcabcbb"
 Вывод: 3
 Пояснение: Ответ: "abc", длина которого равна 3.
Пример 2:

Ввод: s = "bbbbb"
 Вывод: 1
 Пояснение: Ответ: "b", длина которого равна 1.
Пример 3:

Ввод: s = "pwwkew"
 Вывод: 3
 Пояснение: Ответ: "wke", длина которого равна 3.
Обратите внимание, что ответ должен быть подстрокой, «pwke» — это подпоследовательность, а не подстрока.

 */

class Solution {
public:
 int lengthOfLongestSubstring(string s) {
 }
};
